window.farm_grow = {};
{
  const 通用各階段圖 = {
    //圖0~7共八個行走圖 8為面向 不用抓路徑 直接抓行走圖名稱 最後一階段 判定長完的圖
    273: [
      [0, 2, "Actor1"],
      [1, 2, "Actor1"],
      [2, 2, "Actor1"],
    ],
    274: [
      [0, 2, "Actor2"],
      [1, 2, "Actor2"],
      [2, 2, "Actor2"],
    ],
    275: [
      [0, 8, "Actor3"],
      [1, 8, "Actor3"],
      [2, 8, "Actor3"],
    ],
    276: [
      [0, 8, "Actor3"],
      [1, 8, "Actor3"],
      [2, 8, "Actor3"],
    ],
    277: [
      [0, 8, "Actor3"],
      [1, 8, "Actor3"],
      [2, 8, "Actor3"],
    ],
    278: [
      [0, 8, "Actor3"],
      [1, 8, "Actor3"],
      [2, 8, "Actor3"],
    ],
    279: [
      [0, 8, "Actor3"],
      [1, 8, "Actor3"],
      [2, 8, "Actor3"],
    ],
    280: [
      [0, 8, "Actor3"],
      [1, 8, "Actor3"],
      [2, 8, "Actor3"],
    ],
    281: [
      [0, 8, "Actor3"],
      [1, 8, "Actor3"],
      [2, 8, "Actor3"],
    ],
    282: [
      [0, 8, "Actor3"],
      [1, 8, "Actor3"],
      [2, 8, "Actor3"],
    ],
  };
  const 通用各階段時間 = {
    //半小時、一小時
    273: [600, 600, 1],
    274: [108000, 216000, 1],
    275: [108000, 216000, 1],
    276: [108000, 216000, 1],
    277: [108000, 216000, 1],
    278: [108000, 216000, 1],
    279: [108000, 216000, 1],
    280: [108000, 216000, 1],
    281: [108000, 216000, 1],
    282: [108000, 216000, 1],
  };
  const 通用植物生長資訊 = {
    273: {
      各階段時間: 通用各階段時間[273],
      各階段圖: 通用各階段圖[273],
    },
    274: {
      各階段時間: 通用各階段時間[274],
      各階段圖: 通用各階段圖[274],
    },
    275: {
      各階段時間: 通用各階段時間[275],
      各階段圖: 通用各階段圖[275],
    },
    276: {
      各階段時間: 通用各階段時間[276],
      各階段圖: 通用各階段圖[276],
    },
    277: {
      各階段時間: 通用各階段時間[277],
      各階段圖: 通用各階段圖[277],
    },
    278: {
      各階段時間: 通用各階段時間[278],
      各階段圖: 通用各階段圖[278],
    },
    279: {
      各階段時間: 通用各階段時間[279],
      各階段圖: 通用各階段圖[279],
    },
    280: {
      各階段時間: 通用各階段時間[280],
      各階段圖: 通用各階段圖[280],
    },
    281: {
      各階段時間: 通用各階段時間[281],
      各階段圖: 通用各階段圖[281],
    },
    282: {
      各階段時間: 通用各階段時間[282],
      各階段圖: 通用各階段圖[282],
    },
  };
  farm_grow[19] = {
    植物生長資訊: 通用植物生長資訊,
    事件id和變數id組: [
      [8, 181],
      [9, 182],
      [10, 183],
    ],
  };
  farm_grow[26] = {
    植物生長資訊: 通用植物生長資訊,
    事件id和變數id組: [
      //事件ID（地圖中的土堆）與變數ID（抓種下的種子是什麼）
      [8, 181],
      [9, 182],
      [10, 183],
      [12, 184],
    ],
  };
  farm_grow[27] = {
    植物生長資訊: 通用植物生長資訊,
    事件id和變數id組: [
      [8, 181],
      [9, 182],
      [10, 183],
      [12, 184],
      [13, 185],
    ],
  };
  farm_grow[28] = {
    植物生長資訊: 通用植物生長資訊,
    事件id和變數id組: [
      [8, 181],
      [9, 182],
      [10, 183],
      [12, 184],
      [13, 185],
      [14, 186],
    ],
  };
  farm_grow[29] = {
    植物生長資訊: 通用植物生長資訊,
    事件id和變數id組: [
      [8, 181],
      [9, 182],
      [10, 183],
      [12, 184],
      [13, 185],
      [14, 186],
      [15, 187],
    ],
  };

  farm_grow[30] = {
    植物生長資訊: 通用植物生長資訊,
    事件id和變數id組: [
      [8, 181],
      [9, 182],
      [10, 183],
      [12, 184],
      [13, 185],
      [14, 186],
      [15, 187],
      [16, 188],
    ],
  };

  farm_grow[31] = {
    植物生長資訊: 通用植物生長資訊,
    事件id和變數id組: [
      [8, 181],
      [9, 182],
      [10, 183],
      [12, 184],
      [13, 185],
      [14, 186],
      [15, 187],
      [16, 188],
      [17, 189],
    ],
  };

  farm_grow[32] = {
    植物生長資訊: 通用植物生長資訊,
    事件id和變數id組: [
      [8, 181],
      [9, 182],
      [10, 183],
      [12, 184],
      [13, 185],
      [14, 186],
      [15, 187],
      [16, 188],
      [17, 189],
      [18, 190],
    ],
  };

  farm_grow[33] = {
    植物生長資訊: 通用植物生長資訊,
    事件id和變數id組: [
      [8, 181],
      [9, 182],
      [10, 183],
      [12, 184],
      [13, 185],
      [14, 186],
      [15, 187],
      [16, 188],
      [17, 189],
      [18, 190],
      [19, 191],
    ],
  };

  farm_grow[34] = {
    植物生長資訊: 通用植物生長資訊,
    事件id和變數id組: [
      [8, 181],
      [9, 182],
      [10, 183],
      [12, 184],
      [13, 185],
      [14, 186],
      [15, 187],
      [16, 188],
      [17, 189],
      [18, 190],
      [19, 191],
      [20, 192],
    ],
  };

  // 如果之後需要改時間，複製一份資訊，然後再修改內容 // const info=JsonEx.makeDeepCopy(通用植物生長資訊); info[總子id].各階段時間[x]=TIME;
}
